[
  {
    "title": "Transparent Magnetic Wireless Charging Jelly Case for Samsung Galaxy A15 A35 A55 A16 A26 A36 A56 A54 M56 A07 A17 A05 A05S A06 Shockproof Clear Cover",
    "price": "Rs. 871"
  },
  {
    "title": "Magnetic Shockproof Phone Case Cover For iPhone 16 15 Pro 14 13 12 Pro Max 11 With Dual Holder",
    "price": "Rs. 713"
  },
  {
    "title": "For Samsung Galaxy A55/A54/A35/A34/A26/A25 5G A24/A16/A15/A14/A05S Soft Case Minimalist Feather Four Corners Anti-fall Cover Has 6 Colors Black Golden Silver Blue Pink Purple(Tip: Please manually select your phone model before choosing the color)",
    "price": "Rs. 900"
  },
  {
    "title": "iPhone 11 Mobile Case - Edge Bumper Transparent Anti Shock TPU Mobile Cover Case",
    "price": "Rs. 137"
  },
  {
    "title": "HOCE Solid Color Magnetic Phone Cases For iPhone 17 16 15 14 Plus 13 12 Pro Max 11 MagSafe Case Wireless Charge Ultra Thin Shockproof Hard PC Back Cover",
    "price": "Rs. 839"
  },
  {
    "title": "iPhone 7 Plus/iPhone 8 Plus Case Transparent Cover",
    "price": "Rs. 136"
  },
  {
    "title": "KATCHY Hard Transparent Magsafe UltraClean Anti Yellow Slim Case with Magnetic Charger Support Precise Holes and Buttons and Camera Protector Bump for Iphone 13 14 15 16 Pro Max",
    "price": "Rs. 899"
  },
  {
    "title": "Case for honor X8B 5G X8A 5G X6B X6A 5G X6C X8C 5G phone casing back cover Softcase Silicone shockproof Cover new design aesthetic Rotatable mirror Cute Bear with holder JTXXZJ01",
    "price": "Rs. 131"
  },
  {
    "title": "100% Waterproof Clear Screen Touchable Mobile Phone Cover For Rainy Day - Mobile Phone Cover ( Color May Vary )",
    "price": "Rs. 87"
  },
  {
    "title": "Glitter Sequins Phone Case For iPhone 15 16 11 12 13 14 Pro Max X XR XS Max 7 8 Plus Cute Bow Makeup Mirror Soft Silicone Cover",
    "price": "Rs. 415"
  },
  {
    "title": "iPhone X/XS/XS Max Transparent Protection Back Cover | Heavy Duty Protection Transparent Phone Back Cover",
    "price": "Rs. 139"
  },
  {
    "title": "Luxury 2 In 1 Metal Frame Compatible for IPhone 15 11 16 12 13 14 Pro Max 16 Pro Max 16 15 14 Plus XR X XS Max Retro Solid Color Couples Soft Case",
    "price": "Rs. 750"
  },
  {
    "title": "Waterproof Mobile Pouch Cover for All Smartphones up to 6.5 Inches, Universal Cellphone Dry Bag for iPhone, Samsung, Mi, Redmi, Oppo, VIVO (Color May Vary)",
    "price": "Rs. 77"
  },
  {
    "title": "Clear Airbag Case for iPhone 11 - Shockproof TPU Transparent Soft Silicone Back Cover",
    "price": "Rs. 145"
  },
  {
    "title": "Samsung M35 5G M14 5G A24 4G A25 5G A34 5G A35 5G A54 5G Clear Cover with Camera Protection Reinforced Corner Bumper Clear Transparent Shockproof Soft Cover Case",
    "price": "Rs. 109"
  },
  {
    "title": "iPhone 11 Mobile Case - Edge Bumper Transparent Anti Shock TPU Mobile Cover Case",
    "price": "Rs. 137"
  },
  {
    "title": "Moto Edge 50 Fusion Soft Silicon Cover With Fur Inside",
    "price": "Rs. 194"
  },
  {
    "title": "Poco F3 Camera Protection Matte Semi Hard Cover",
    "price": "Rs. 149"
  },
  {
    "title": "Clear case for Samsung Galaxy A24 - Transparent Soft Shockproof Cover",
    "price": "Rs. 141"
  },
  {
    "title": "Phone Case for Xiaomi Redmi Note 14 Pro 5G with Slide Camera Cover and Rotating Kickstand Ring, Slim Magnetic Shockproof Case",
    "price": "Rs. 966"
  },
  {
    "title": "For iPhone 7 Plus / 8 Plus Case Cover - Crystal Clear/Ultra-Slim/Hard PC + Soft TPU Transparent Back Cover",
    "price": "Rs. 142"
  },
  {
    "title": "Samsung A16 5G A15 4G/5G A25 5G A35 5G A55 5G M35 5G Clear Cover with Camera Protection Reinforced Corner Bumper Clear Transparent Shockproof Soft Cover Case",
    "price": "Rs. 148"
  },
  {
    "title": "Redmi Note 9 Pro Max Back Camera Protection Cover / Case",
    "price": "Rs. 188"
  },
  {
    "title": "OnePlus 9R TPU case Transparent Silicone Soft Cover",
    "price": "Rs. 196"
  },
  {
    "title": "Redmi 12C 4G Clear Transparent TPU Silicon Cover",
    "price": "Rs. 149"
  },
  {
    "title": "Soft Silicon Case With Fur Inside For Iphone 13",
    "price": "Rs. 249"
  },
  {
    "title": "Gengar Pattern Laser Phone Case For Samsung Galaxy A56 A16 A55 A54 A15 Anti-slip design on the side Pikachu",
    "price": "Rs. 652"
  },
  {
    "title": "Soft Silicon Case with Inner Fur Lining for iPhone 11 Shockproof Protective Back Cover",
    "price": "Rs. 279"
  },
  {
    "title": "Dirt-resistant Anti-knock Phone Case For VIVO Y29 4G/T4X 5G Phone Pouch Silicone Waterproof Phone Protector Durable Cute",
    "price": "Rs. 358"
  },
  {
    "title": "Redmi Note 14 (5G) Slide Camera Cover Luxury Phone Case ",
    "price": "Rs. 601"
  },
  {
    "title": "Clear case for iPhone 13 - Transparent Soft Shockproof Crystal TPU Back Cover with Edges",
    "price": "Rs. 162"
  },
  {
    "title": "Touchable Waterproof Pouch For Mobile Phone",
    "price": "Rs. 114"
  },
  {
    "title": "Clear Case for Redmi Note 10 Pro / Max - Casing Airbag Luxury Silicone Back Cover - Transparent",
    "price": "Rs. 141"
  },
  {
    "title": "Dreamy Vintage Cartoon Cool Creative Bracelet Case Compatible for IPhone 16 15 12 13 14 11 Pro Max XR 7Plus X XS MAX 14 8 7 15 Plus SE Luxury Laser Waves Water Soft Case",
    "price": "Rs. 750"
  },
  {
    "title": "Transparent Shockproof Airbag Case for iPhone 12 Soft TPU Silicone Back Cover Anti-Scratch",
    "price": "Rs. 150"
  },
  {
    "title": "Winnie Bear Black White Cats Phone Case Compatible for IPhone 15 11 12 13 14 7 8 Pro Max XR X XS Max Soft Shockproof Cover",
    "price": "Rs. 746"
  },
  {
    "title": "Bead Flower Hand Strap Bracelet Phone Case for iPhone 6-15 Pro Max Oil Paint Green Love Heart",
    "price": "Rs. 835"
  },
  {
    "title": "Soft Silicon Case With Fur Inside For Iphone 13",
    "price": "Rs. 242"
  },
  {
    "title": "Samsung Galaxy A55 A35 A25 A15 A05S A05 A54 A04 A34 A33 Irregular Design Phone Soft Case Attached 3D Doll Kuromi Frog A73/A53/A13 5G with Bracelet",
    "price": "Rs. 659"
  },
  {
    "title": "HOCE Translucent Magnetic Phone Cases For iPhone 16 15 14 13 12 11 Pro Max 14 15 16 Plus MagSafe Case Colorful Soft Shockproof Bumper Clear Matte Hard Back Cover",
    "price": "Rs. 929"
  },
  {
    "title": "Cute 3D Doll Hello Kitty Fashion Flip Bracket Makeup Mirror Case Compatible for IPhone 16 11 13 14 12 15 Pro Max 7Plus 6 15 6S 8 7 Plus XR X XS Max SE 2020 Cartoon Cat Angel Eye Cover",
    "price": "Rs. 768"
  },
  {
    "title": "Sroof Case For Samsung Galaxy A03s A04e A14 A15 A16 A25 A26 A30 A32 A34 A35 A36 A51 A52 A53 A54 A55 A56 S20 S21 S23 FE S21 S22 S23 S24 S25 Ultra S23 Plus S24 Plus S25 Plus New wavy edge silicone soft cute cartoon Stitch thicker fall prevention Phone Case",
    "price": "Rs. 999"
  },
  {
    "title": "Angel Eye Cover Compatible for IPhone 8 7Plus XR 12 14 11 13 15 Pro Max 8 6 7 15 6S Plus X XS Max SE 2020 Trendy Brand Colored Fashion Icons Couple Soft Case",
    "price": "Rs. 743"
  },
  {
    "title": "Samsung Galaxy S22 Ultra Ipaaky Case With Back Transparent Case",
    "price": "Rs. 227"
  },
  {
    "title": "Premium Silicone Case For iPhone Xs Max By Panchakumari Mobile Hub",
    "price": "Rs. 427"
  },
  {
    "title": "Google Pixel 6 6a 6 Pro 7 7a 7 Pro 8 8a 8 Pro Crystal Clear Cover with Camera Protection Reinforced Corner Bumper Clear Transparent Shockproof Soft Cover Case",
    "price": "Rs. 174"
  },
  {
    "title": "MARVEL Spider Man Phone Case Compatible for IPhone 11 15 12 14 13 Pro Max X XR XS Max Luxury Plating Metal Shockproof Soft Case",
    "price": "Rs. 809"
  },
  {
    "title": "Hontinga for iPhone 5 6 6s 7 8 Plus SE 2020 2022 X XR XS MAX Back Cover Spider-Man Pattern Ladder Soft Camera Protection Rubber Phone Case",
    "price": "Rs. 775"
  },
  {
    "title": "Iphone 6 Plus / 6s Plus Transparent Case / Cover",
    "price": "Rs. 146"
  },
  {
    "title": "Silicone case for Samsung Galaxy A16 5G | Microfiber Inside | 360 Degree Camera Protection Bump Back Phone Cover",
    "price": "Rs. 304"
  },
  {
    "title": "Masala Beads Luxury Rhinestone Cherry Design Transparent Mirror Glass Phone Cases For iPhone TPU Protective Cover For Women Shock proof Clear Case Covers Girls Gift",
    "price": "Rs. 450"
  },
  {
    "title": "Google Pixel 6A Soft Silicon Niukin Cover",
    "price": "Rs. 378"
  },
  {
    "title": "Redmi Pad 2 11 inch Tablet Executive Leather Case",
    "price": "Rs. 1,350"
  },
  {
    "title": "Soft Silicon Case With Fur Inside For Iphone 13 Pro Max",
    "price": "Rs. 242"
  },
  {
    "title": "Sroof Case For Samsung Galaxy A22 A23 A24 A25 A31 A32 A33 5G A34 A35 A50 A51 A52 A53 A54 A55 A56 Fashionable and Cute Cream Plush Phone Case with Six Animal Types Pacha Dog Strawberry Bear phone case back cover",
    "price": "Rs. 789"
  },
  {
    "title": "Apple MagSafe clear case -Transparent Magnetic Cover For Iphone All Model - 7Plus To 16 Pro Max (Premium Look Cover)",
    "price": "Rs. 499"
  },
  {
    "title": "Retro Art Dream Butterfly Cartoon Flowers Rose Case Compatible for IPhone 15 14 13 12 11 Pro Max XR X 7 15 6s 8 6 Plus XS Max SE2020 Luxury Mirror 3D Wavy Curved Edge Plating Case",
    "price": "Rs. 758"
  },
  {
    "title": "Xiaomi Redmi Note 14 Pro 5G Phone Case,Magnetic Shockproof Phone Case Cover for Xiaomi Redmi Note 14 Pro 5G",
    "price": "Rs. 915"
  },
  {
    "title": "Samsung A12/ Samsung M12 / Samsung F12 Transparent Clear Cover Case",
    "price": "Rs. 172"
  },
  {
    "title": "Soft Clear Case for Samsung A53 5G Protective Transparent Reinforced Corners TPU Shock-Absorption Flexible Cell Phone Cover",
    "price": "Rs. 123"
  },
  {
    "title": "Oil Painting Romantic Butterfly Phone Case Compatible For IPhone 16 11 15 13 14 12 Pro Max X 7Plus XR 7 8 6S 6 Plus XS MAX Vintage Angel Eyes Soft Cover",
    "price": "Rs. 799"
  },
  {
    "title": "Transparent Cover For Iphone 13",
    "price": "Rs. 136"
  },
  {
    "title": "Clear case for Samsung A55 5g Transparent Soft Shockproof Cover",
    "price": "Rs. 140"
  },
  {
    "title": "MissConnie Solid Color Phone Case Compatible for IPhone 11 15 14 13 12 Pro Max XR X XS Max Macaron Candy Color Luxury Silicon Shockproof Cover",
    "price": "Rs. 699"
  },
  {
    "title": "Only For Samsung Galaxy Note 8 Bumper Case | Back Hard Transparent Clear Shockproof TPU Phone Cover |",
    "price": "Rs. 352"
  },
  {
    "title": "Oppo F19 Pro Border Transparent Bumped Cover",
    "price": "Rs. 190"
  },
  {
    "title": "Samsung F22, A22 & M32 Soft Silicone case TPU Transparent Back cover",
    "price": "Rs. 160"
  },
  {
    "title": "Samsung Galaxy M16 (5G) Samsung Galaxy F16 (5G) Clear ipacky Back case",
    "price": "Rs. 171"
  },
  {
    "title": "HOCE Camera Glass Protective Holder Magnetic Phone Cases For iPhone 17 16 15 14 13 12 11 Pro Max 14 15 16 Plus MagSafe Case Armor Shockproof Bumper Hard Acrylic Matte Back Cover",
    "price": "Rs. 1,389"
  },
  {
    "title": "Clear Airbag Case for iPhone 7 + / 8 Plus - Shockproof TPU Transparent Soft Silicone Phone Back Cover",
    "price": "Rs. 150"
  },
  {
    "title": "Soft Silicon Case With Fur Inside For Samsung Galaxy S9 Plus",
    "price": "Rs. 247"
  },
  {
    "title": "Ipaky Vivo Y100 5G / Vivo T2 5G Super Series Mobile Cover Case Shell",
    "price": "Rs. 260"
  },
  {
    "title": "Transparent Clear Cover For Redmi Note 10 4G / 10s",
    "price": "Rs. 141"
  },
  {
    "title": "Clear case for Samsung Galaxy S25 Ultra - Transparent Soft Shockproof Airbag Crystal Phone Back Cover",
    "price": "Rs. 261"
  },
  {
    "title": "Realme 9(4G) Border Cover With Back Transparent",
    "price": "Rs. 240"
  },
  {
    "title": "Slide Camera Cover Case for Vivo V50 Lite, Magnetic Rotate Ring Holder Heavy Duty TPU+PC Shockproof Drop Protect Phone Case",
    "price": "Rs. 966"
  },
  {
    "title": "【Get One Free Bracelet】Sroof Case For iPhone 11 12 13 14 15 16 Pro Max New fun sliding window series three-dimensional big smile Doraemon Phone Case Back Cover",
    "price": "Rs. 1,079"
  },
  {
    "title": "Transparent Ceramic Camera Protection Case for iPhone XS Max",
    "price": "Rs. 249"
  },
  {
    "title": "Amo Store Riple Case | Premium Soft/Hard Back Cover | Compatible with iPhone X, 11, 12, 13, 14, 15, 16, Pro & Pro Max Models | Stylish & Durable Design",
    "price": "Rs. 607"
  },
  {
    "title": "HOCE Camera Holder Magnetic Phone Cases For iPhone 16 15 14 13 12 11 Pro Max 14 15 16 Plus MagSafe Case Armor Shockproof Soft Silicone Logo Hole Back Cover",
    "price": "Rs. 1,049"
  },
  {
    "title": "⚡24-hour shipping+free shipping+COD⚡Sanrio Ins Hello Kitty phone case suitable for iPhone 16 15 14 13 12 11 Pro Max/Plus/Pro XR XS Max 7 8 6 5 Plus MINI girls transparent gift silicone anti drop-Good quality",
    "price": "Rs. 359"
  },
  {
    "title": "HODON Luxury Matte Candy Color Magnetic Phone Cases For Samsung Galaxy S21 S22 S23 S24 S25 Ultra S25 Plus Note 20 Ultra For Magsafe Case Wireless Charging Shockproof PC Hard Cover",
    "price": "Rs. 919"
  },
  {
    "title": "For Poco X5 Pro (5G) Defender Case | Rotating Ring Holder & Kickstand in-Built - Camera Protection",
    "price": "Rs. 570"
  },
  {
    "title": "Clear Case for Samsung Galaxy S25 Ultra Four-Side Airbag Camera Protection Cover",
    "price": "Rs. 175"
  },
  {
    "title": "Soft Silicon Case with Fur Inside for iPhone 14 Pro Max - Protective, Comfortable, Stylish",
    "price": "Rs. 249"
  },
  {
    "title": "Clear Shockproof TPU Airbag Case for iPhone 13 Transparent Soft Silicone Cover with Anti Yellowing and Wireless Charging Support",
    "price": "Rs. 150"
  },
  {
    "title": "HODON Luxury Plating Slim Thin Frameless Transparent Phone Case For Samsung S25 S24 S23 S22 Ultra S24 Plus Cases Camera Protection Clear PC Hard Cover",
    "price": "Rs. 959"
  },
  {
    "title": "MagSafe Compatible Shockproof Transparent Slim Fit Wireless Charging supported Frosted Border Phone Back Case Mobile Cover -For Apple iPhone 7plus,8plus,x,xs,xr,xsmax,11,12,13,14,15,16,pro,promax,12,13mini,14,15,16plus All Model",
    "price": "Rs. 499"
  },
  {
    "title": "POCO F3 Silicone Case with Camera Protection Back Cover",
    "price": "Rs. 309"
  },
  {
    "title": "Premium Silicone Case For iPhone 13 Pro Max By Lavish Deals",
    "price": "Rs. 295"
  },
  {
    "title": "Durable Silicone Phone Case For VIVO Y29 4G/T4X 5G protective Fashion Design Soft case Graffiti Dirt-resistant Anti-dust",
    "price": "Rs. 358"
  },
  {
    "title": "Magnetic Shockproof Phone Case Cover For iPhone 15 to16 to 16 Pro Max With Dual Holder",
    "price": "Rs. 999"
  },
  {
    "title": "Iphone 11 Full Protection Air Case With Camera Protection",
    "price": "Rs. 350"
  },
  {
    "title": "Trend Brand Cartoon Cute Hello Kitty Doodle DIY 3D Doll Folding Bracket Compatible for IPhone 11 14 16 1315 12 Pro Max 14 16 15 Pro 16 Plus Luxury Bracelet Feather Yarn Soft Case",
    "price": "Rs. 838"
  },
  {
    "title": "Nothing 3A Fashionury Ring Line Beam Design Back Case",
    "price": "Rs. 218"
  },
  {
    "title": "Pearl Bracelet Phone Case Compatible for IPhone 7Plus 11 14 13 12 Pro Max XR X 7 6s 6 8 Plus XS Max SE 2020 Fashion Gradient Love Heart 3D Wavy Curved Edge Stand Holder Soft Cover",
    "price": "Rs. 739"
  },
  {
    "title": "Amo Store Heart iPhone Case | Stylish & Protective Soft/Hard Back Cover | Compatible with iPhone 11, 12, 13, 14, 15, 16, Pro & Pro Max Models | Trendy & Durable Love Design",
    "price": "Rs. 550"
  },
  {
    "title": "Cartoon Couple Luxury Laser Waves Water Card Case Compatible for IPhone 16 7Plus XR 14 15 13 11 12 Pro Max 14 7 15 8 Plus X Xs Max SE 2020 Trendy Cute Dreamy Pink Love Heart Soft Case",
    "price": "Rs. 761"
  },
  {
    "title": "Motorola Moto G85 (5G) Slide Camera Cover Luxury Phone Case",
    "price": "Rs. 446"
  },
  {
    "title": "For Samsung Galaxy A55/A54/A35/A34/A26/A25 5G A24/A16/A15/A14/A05S Soft Case Pretty Sakura Flower Four Corners Anti-fall Cover Has 6 Colors Black Golden Silver Blue Pink Purple(Tip: Please manually select your phone model before choosing the color)",
    "price": "Rs. 980"
  },
  {
    "title": "Shockproof Clear Phone Case For iPhone X/XS, Transparent Protection Back Cover",
    "price": "Rs. 169"
  },
  {
    "title": "Rubber Case for Huawei Y9S, STK-L21, STK-LX3, STK-L22 Soft Back Cover",
    "price": "Rs. 117"
  },
  {
    "title": "Vivo T4 (5g) Ipaaky Transparent Back Case",
    "price": "Rs. 208"
  },
  {
    "title": "Jizetin for Redmi 13 Xiaomi Poco M6 4G Back Cover Batman Lambskin Texture PU Leather Back For Girls Boys Soft Phone Case",
    "price": "Rs. 779"
  },
  {
    "title": "Motorola Edge 50 Fusion (5G) Clear Ipacky Back Case",
    "price": "Rs. 181"
  },
  {
    "title": "Anti-knock Silicone Phone Case For infinix GT 30 Pro/X6873 Soft case Dirt-resistant Full wrap Cute TPU Durable Cartoon",
    "price": "Rs. 358"
  },
  {
    "title": "Silicone Case for Samsung Galaxy S21 FE - Camera Protective Flexible Phone Back Cover",
    "price": "Rs. 275"
  },
  {
    "title": "Clear Airbag Case for iPhone 12 Pro - Shockproof TPU Transparent Soft Silicone Phone Back Cover",
    "price": "Rs. 150"
  },
  {
    "title": "Clear Transparent Shockproof Soft Tpu Cover Case For Samsung S20 FE",
    "price": "Rs. 185"
  },
  {
    "title": "REDMI POCO C3 Shockproof Crystal Clear Back Cover With Bumper",
    "price": "Rs. 356"
  },
  {
    "title": "Mobile Cover Samsung Galaxy A13 4G Transparent Clear Case",
    "price": "Rs. 115"
  },
  {
    "title": "iPhone X / XS Shockproof Transparent Back Cover - Transparent Shockproof TPU Case - Mobihub",
    "price": "Rs. 138"
  },
  {
    "title": "Ipaky Google Pixel Series 6/6a/6 Pro/7/7a/7 Pro/8/a/8 Pro Super Series Mobile Cover Case Shell",
    "price": "Rs. 208"
  },
  {
    "title": "Samsung F22, A22 & M32 Soft Silicone case TPU Transparent Back cover",
    "price": "Rs. 176"
  },
  {
    "title": "Google Pixel 7 Soft Silicon Cover With Internal Fur",
    "price": "Rs. 250"
  },
  {
    "title": "Starbuck Coffee Kitty Cat Little Pufferfish Cartoon Graffiti Phone Case Compatible for IPhone 11 15 14 13 12 Pro Max XR X XS MAX Shockproof Cover",
    "price": "Rs. 746"
  },
  {
    "title": "Transparent Soft TPU Protective Case / Cover For OnePlus Nord CE 3 Lite 5G",
    "price": "Rs. 195"
  },
  {
    "title": "Ring Stand Shockproof Armor Case For Honor 90 (5G)",
    "price": "Rs. 421"
  },
  {
    "title": "Clear case for Redmi 10 Prime - Transparent Soft Shockproof Airbag Crystal Back Cover",
    "price": "Rs. 162"
  },
  {
    "title": "Clear Case for Samsung Galaxy A34 5G - Camera Protection Soft Bumper Transparent Shockproof Slim Back Cover",
    "price": "Rs. 214"
  },
  {
    "title": "Luxury Slide Camera Lens Cover for Honor 400 Lite Shockproof Bumper Cover vehicle-mounted Magnetic Kickstand Cover",
    "price": "Rs. 939"
  },
  {
    "title": "Silicone Case For iPhone 15 Pro Max/ iPhone 15 Pro / iPhone 15 plus /iPhone 15",
    "price": "Rs. 288"
  },
  {
    "title": "Nothing CMF Phone 1 (5G) -Back Cover | Liquid Silicon Magic Case with Camera Protection | Black",
    "price": "Rs. 455"
  },
  {
    "title": "Sroof Case For Samsung A06 A14 A15 A16 A54 A55 S22 S23 S24 S25 Ultra New Premium Feeling Frosted Skeleton Flame Heat Dissipation Phone Case Back Cover",
    "price": "Rs. 809"
  },
  {
    "title": "Silicone Case For Iphone X /Xs /Xr /Xs Max",
    "price": "Rs. 189"
  },
  {
    "title": "Oppo F21 Pro 5G Reno 7Z Reno 8Z 5G Transparent Clear Hybrid Shockproof Slim Phone Case",
    "price": "Rs. 210"
  },
  {
    "title": "Infinix Note 7 Lite Ipaky Case With Back Transparent",
    "price": "Rs. 225"
  },
  {
    "title": "Art Oil Painting Fresh Flowers Case Compatible for IPhone 11 16 13 14 12 15 Pro Max 7Plus XR X XS MAX 8 16 14 15 7 Plus SE 2020 Fashion Feather Yarn Soft Floral Cover",
    "price": "Rs. 732"
  },
  {
    "title": "Clear Case Xiaomi Mi Note 10 Lite (M2002F4LG, M1910F4G) Soft Protective Cover",
    "price": "Rs. 147"
  },
  {
    "title": "Poco F3 GT Ipaky Case With Back Transparent Case",
    "price": "Rs. 242"
  },
  {
    "title": "Huawei Y9 Prime (2019) Semi Hard Border Cover",
    "price": "Rs. 160"
  },
  {
    "title": "Silicone Case For Samsung Galaxy A52 / A52s 5G",
    "price": "Rs. 343"
  },
  {
    "title": "Clear Cover Realme C35 Soft Case",
    "price": "Rs. 147"
  },
  {
    "title": "Nothing Phone 3A (5G) Flexible TPU Clear Case",
    "price": "Rs. 135"
  },
  {
    "title": "Sroof Case For iPhone 11 12 13 14 15 16 Pro Max X XR XS Max 14 15 16 Plus New Premium Feeling Leather Solid Color with Apple Logo Phone Case Back Cover",
    "price": "Rs. 659"
  },
  {
    "title": "Iphone 8 Plus Soft Silicon Case With Fur Inside",
    "price": "Rs. 242"
  },
  {
    "title": "Bumper Case for Vivo V30 (5G) - 360 Degree Protection | Protective Design | Transparent Back Cover",
    "price": "Rs. 355"
  },
  {
    "title": "Back Cover Case for Samsung A33 5G Transparent Back Cover Case",
    "price": "Rs. 249"
  },
  {
    "title": "Biruiqu For Oneplus 7T Hybrid Soft TPU Deer Pattern Leather Shockproof Case Cover",
    "price": "Rs. 899"
  },
  {
    "title": "Dirt-resistant Waterproof Phone Case For Honor X6c Back Cover protective Cover Durable Shockproof Soft case Cute TPU",
    "price": "Rs. 358"
  },
  {
    "title": "Transparent Cover Samsung Galaxy A32 5G Clear Case",
    "price": "Rs. 123"
  },
  {
    "title": "Soft Silicon Case with Fur Inside for iPhone 12 – Available in Multiple Colors",
    "price": "Rs. 249"
  },
  {
    "title": "Ipaky Apple iPhone XR Super Series Mobile Cover Case Shell",
    "price": "Rs. 224"
  },
  {
    "title": "Poco F1 Ipaky Case With Back Transparent Case",
    "price": "Rs. 242"
  },
  {
    "title": "Niukin Soft Pattern case For OnePlus 5T",
    "price": "Rs. 387"
  },
  {
    "title": "Jizetin for Xiaomi Poco X3 Pro / Poco X3 NFC Back Cover Spider Man PU Leather For Girls Boys Soft Phone Case",
    "price": "Rs. 779"
  },
  {
    "title": "For Redmi Note 14 5G Back Bumper Case - Clear PC Back Hybrid Transparent Phone Cover",
    "price": "Rs. 316"
  },
  {
    "title": "Ipaky Samsung Galaxy A32 4G Super Series Mobile Cover Case Shell",
    "price": "Rs. 249"
  },
  {
    "title": "OnePlus Nord 5G Clear Transparent Soft Shockproof Cover",
    "price": "Rs. 145"
  },
  {
    "title": "Ipaaky Case For Samsung Galaxy C7/C7 Pro",
    "price": "Rs. 235"
  },
  {
    "title": "Clear case for Samsung Galaxy S8 - Transparent Soft Shockproof Airbag Crystal Phone Back Cover",
    "price": "Rs. 217"
  },
  {
    "title": "Back Glass Panel For Redmi K20/K20 Pro",
    "price": "Rs. 727"
  },
  {
    "title": "Back Case Cover for OnePlus 13R | Compatible for OnePlus 13R Back Case Cover | Bumper Shockproof Case- Transparent",
    "price": "Rs. 188"
  },
  {
    "title": "Samsung Note 10 Lite Clear Transparent Shockproof Soft Tpu Cover Case",
    "price": "Rs. 164"
  },
  {
    "title": "Iphone 7 Plus/8 Plus AirSkin Case With Back Transparent And Mag Safe Support",
    "price": "Rs. 380"
  },
  {
    "title": "Realme X3 / X50 Transparent Clear Hybrid Shockproof Slim Phone Case",
    "price": "Rs. 210"
  },
  {
    "title": "HOCE Slim Matte Magnetic For Magsafe Case For Samsung Galaxy S25 Plus S24 S23 S22 S21 Ultra Note 20 Ultra Cases Wireless Charge PC Hard Back Cover",
    "price": "Rs. 870"
  },
  {
    "title": "Xiaomi Poco X3/Pro/NFC Clear Soft Transparent TPU Case",
    "price": "Rs. 149"
  },
  {
    "title": "Samsung Note 9 Transparent Clear Hybrid Shockproof Slim Phone Case",
    "price": "Rs. 210"
  },
  {
    "title": "Armor Case For Redmi Note 12 (5G) Back Phone Cover | Dual Layer Armor Defender Full Body Protective + PC Hybrid Kickstand",
    "price": "Rs. 637"
  },
  {
    "title": "Sroof Case For Samsung Galaxy S21+ S22+ S23+ S24+ S25+ S21 Ultra S22 Ultra S23 Ultra S24 Ultra S25 Ultra S25 Edge S23 FE S24 FE New advanced sense of temperament plating soft edge DIY three-dimensional bow tie phone case back cover",
    "price": "Rs. 929"
  },
  {
    "title": "Samsung S24 Ultra NIUKIN Luxury Phone Case",
    "price": "Rs. 388"
  },
  {
    "title": "Protective Transparent Back Cover for Redmi 13 4G with black border and 4 corner airbag protection",
    "price": "Rs. 292"
  },
  {
    "title": "Casetify Embossed Premium Cover |iPhone 7+ & 8+| Multi Design|",
    "price": "Rs. 314"
  },
  {
    "title": "A Bold Attempt Batman Cover for Apple iPhone X & iPhone XS (5.8\") Soft Silicone Edge Protective Phone Case",
    "price": "Rs. 172"
  },
  {
    "title": "Waterproof Universal Pouch For All Smartphones (Color Assorted)",
    "price": "Rs. 150"
  },
  {
    "title": "Phone Case for Realme Narzo 50A - Back Clear Hard Cover Camera Protection Phone Case Soft Casing",
    "price": "Rs. 356"
  },
  {
    "title": "Poco M5 4G and Poco M4 5G Protective Transparent back cover with 4 Corner Airbag Protection",
    "price": "Rs. 195"
  },
  {
    "title": "Soft Premium Leather Cover for Samsung Note 8 - Durable, Elegant, Full Protection for Your Device",
    "price": "Rs. 350"
  },
  {
    "title": "Fashion Christmas Label Colorful Love Heart DIY 3D Lazy Kitten Doll Case Compatible for IPhone 11 16 13 12 15 14 Pro Max XR X 16 14 15 Plus XS Max Luxury Leather Texture Case",
    "price": "Rs. 638"
  },
  {
    "title": "Redmi 12 4G Shockproof Transparent Back Case",
    "price": "Rs. 217"
  },
  {
    "title": "Samsung A22/F22/M32 |SM Premium Soft Cover| Multi Color and Design|",
    "price": "Rs. 294"
  },
  {
    "title": "Creative Cute DIY 3D Doll Cartoon Funny Doodle Case Compatible for IPhone 13 11 15 12 14 Pro Max 7Plus XR X 7 8 15 14 Plus XS Max SE Luxury Couple Soft Cover",
    "price": "Rs. 779"
  },
  {
    "title": "Oppo Reno 8 (5g) Border Cover With Back Transparent",
    "price": "Rs. 242"
  },
  {
    "title": "Ipaky Xiaomi Redmi Note 12 4G Super Series Mobile Cover Case Shell",
    "price": "Rs. 228"
  },
  {
    "title": "Oppo F29 Pro (5g) Border Case With Back Transparent Cover",
    "price": "Rs. 280"
  },
  {
    "title": "Rubber Case for Xiaomi Redmi 6A Soft Back Cover",
    "price": "Rs. 150"
  },
  {
    "title": "Luffy Graffiti Letter Label One Piece Phone Case Compatible for IPhone 15 11 12 13 14 7 8 Pro Max XR X XS Max Soft Shockproof Cover",
    "price": "Rs. 791"
  },
  {
    "title": "Vivo Y20/ Y20i/ Y12S/ Y30/ Y11S/ iqo-U1X/ Y20S/ Y20A Ipaky Mobile Cover, Mobile Case, Back Cover Shockproof, Drop Protection, Non Yellowing",
    "price": "Rs. 197"
  },
  {
    "title": "Realme XT / X2, Soft Flexible Matte Silicone Finish Smooth Grip Candy Case - Black and Blue",
    "price": "Rs. 325"
  },
  {
    "title": "Bumper Case for Samsung Galaxy A9 2018, 360 Degree Protection, Shockproof, Transparent Back Cover, Anti-Slip, Dual Layer, Waterproof, Non-Yellowing",
    "price": "Rs. 375"
  },
  {
    "title": "Realme C35 Transparent Clear Hybrid Shockproof Slim Phone Case",
    "price": "Rs. 210"
  },
  {
    "title": "Nothing Phone 3A Pro (5G) Flexible TPU Clear Case",
    "price": "Rs. 179"
  },
  {
    "title": "3In1 Curved Privacy Tempered Glass For Infinix Hot 50 Pro Plus 5G 2025 Screen Protector Full Cover For Hot50Pro+ Hot50 50Pro 50Pro+ Camera Lens Film+back film",
    "price": "Rs. 126"
  },
  {
    "title": "For Redmi 9c/10A, Poco C31 Back Case - Clear PC Back Hybrid Transparent Phone Cover",
    "price": "Rs. 270"
  },
  {
    "title": "Soft Silicon Case With Fur Inside For Poco F3 GT",
    "price": "Rs. 242"
  },
  {
    "title": "Clear case for iPhone 12 mini - Transparent Crystal Back Case Protective Cover",
    "price": "Rs. 276"
  },
  {
    "title": "Techno Spark 7T Camera Protection Soft Case Small Hole Phone Case Back Clear Cover",
    "price": "Rs. 375"
  },
  {
    "title": "Samsung Galaxy S8 Plus Soft Silicon Case With Fur Inside",
    "price": "Rs. 242"
  },
  {
    "title": "Vivo V17/ Vivo V19 Neo/ Vivo V19 Non Yellowing Transparent Shockproof Mobile Phone Case Cover",
    "price": "Rs. 123"
  },
  {
    "title": "Amo Store Naruto Anime Pain iPhone Case | Premium Soft/Hard Back Cover | Compatible with iPhone 11, 12, 13, 14, 15, 16, Pro & Pro Max Models | Stylish & Durable Design for Anime Fans",
    "price": "Rs. 601"
  },
  {
    "title": "Leather+TPU Case for Samsung Galaxy A50, A50s & A30s Logo Cover",
    "price": "Rs. 145"
  },
  {
    "title": "Samsung Galaxy A26 (5G) NIUKIN Luxury Phone Case",
    "price": "Rs. 306"
  },
  {
    "title": "Honor 50 Lite Soft Silicon Cover With Fur Inside",
    "price": "Rs. 242"
  },
  {
    "title": "Plating Metal Cool Creative Spider Man Phone Case Compatible for IPhone 11 15 Por Max 14 11 12 13 Pro Max XR XS Max X Spider-Man Soft Cover",
    "price": "Rs. 809"
  },
  {
    "title": "Masala Beads Luxury Bling Y2K Gothic Cross Love Heart Flame Snake Clear Phone Case Hard Transparent Cover For I-Phone Shockproof Cases Vintage Style Covers",
    "price": "Rs. 495"
  },
  {
    "title": "Cat Ears Couple Simple Cartoon Bear Expression Case Compatible for IPhone 11 16 13 15 14 12 Pro Max XR 7Plus X 16 15 7 14 8 Plus XS Max SE 2020 Cute Kitten Transparent Soft Case",
    "price": "Rs. 755"
  },
  {
    "title": "Hontinga for Redmi Note 11 Note 11S Back Cover Fashion KAWS Side Design Soft Liquid Silicone Phone Case",
    "price": "Rs. 839"
  },
  {
    "title": "Case for Samsung Galaxy S9 / S9 Plus - Silicone Shockproof Mobile Phone Back Cover",
    "price": "Rs. 257"
  },
  {
    "title": "For iPhone 15 Crystal Clear Series Shockproof PC + TPU Protective Phone Case (Transparent)",
    "price": "Rs. 191"
  },
  {
    "title": "Transparent Shockproof Back Case for iPhone 12 / 12 Pro / 12 Mini (6.1\") - Mobihub",
    "price": "Rs. 146"
  },
  {
    "title": "OnePlus 8T / 9R - Premium Liquid Silicone Silky Soft Gel Rubber Shockproof Back Cover Case",
    "price": "Rs. 309"
  },
  {
    "title": "Silicone Waterproof Phone Case For Nokia G42 5G Wristband Fashion Design Lanyard Soft case Kickstand protective Graffiti",
    "price": "Rs. 358"
  },
  {
    "title": "Ring Stand Shockproof Armor Case For Redmi Note 11 / 11s",
    "price": "Rs. 587"
  },
  {
    "title": "Matte Magsafe Case for Samsung Galaxy S21 Ultra by Lavish Deals",
    "price": "Rs. 751"
  },
  {
    "title": "Lenuo For Samsung Galaxy A55 5G Back Cover Anti Falling Camera Protection Car Holder Cover Armor Hard Bracket Protection Phone Case",
    "price": "Rs. 1,442"
  },
  {
    "title": "Nothing CMF Phone 2 Pro Transparent Case Shockproof Protective Phone Cover Thin Slim Case for Nothing CMF Phone 2 Pro",
    "price": "Rs. 649"
  },
  {
    "title": "Hontinga for Xiaomi Poco X3 NFC Poco X3 Pro Back Cover Flower Cream Wavy Edge Silicone Phone Case",
    "price": "Rs. 806"
  },
  {
    "title": "Iphone XS Max Leather Original Cover",
    "price": "Rs. 1,092"
  },
  {
    "title": "Clear Shockproof Cover for Samsung Galaxy S25 S24 S23 S22 S21 Ultra S25+ S24+ S23+ S22+ S21+ S24 FE S23 FE S21 FE edge Transparent Magnetic Charging Phone Case",
    "price": "Rs. 899"
  },
  {
    "title": "Hontinga for OnePlus Nord 2 5G Back Cover Fashion Racing Side Design Soft Liquid Silicone Phone Case",
    "price": "Rs. 839"
  },
  {
    "title": "Luxury Mirror Make Up Cartoon Flowers Cute Tulips Casing Compatible for IPhone 16 15 12 14 11 13 Pro Max XR 7Plus XS Max X 8 7 15 Plus Romantic Picture Frame Butterfly Starry Sky Case",
    "price": "Rs. 763"
  },
  {
    "title": "Soft Casing For Xiaomi Redmi Note 13 Pro Plus Note13Pro+ 13proplus RedmiNote13 ProPlus 4G 5G 2024 Phone Case Silicone Carbon Fiber Protector ShockProof Bumper Soft Back Cover",
    "price": "Rs. 555"
  },
  {
    "title": "Hontinga for Realme 9 4G Realme 9 Pro Plus Realme Narzo 50 Pro 5G Back Cover Fashion KAWS Side Design Soft Liquid Silicone Phone Case",
    "price": "Rs. 839"
  },
  {
    "title": "Poco F3 Ipaky Case With Back Transparent Case",
    "price": "Rs. 242"
  },
  {
    "title": "HODON Luxury Matte Clear Magnetic Phone Cases for Samsung Galaxy S25 Plus S24 S23 S22 S21Ultra Note 20 Ultra Magsafe Case Transparent Hard PC Ultra Slim Cover",
    "price": "Rs. 1,049"
  },
  {
    "title": "Samsung Galaxy S10 5G Camera Transparent Protection Back Cover",
    "price": "Rs. 236"
  },
  {
    "title": "OnePlus 7T Border Cover With Back Transparent",
    "price": "Rs. 232"
  },
  {
    "title": "NILLKIN For OnePlus Nord CE3 Phone Cases Luxury Super Frosted Shield PC Hard Protection Back Cover For One Plus Nord CE 3 5G",
    "price": "Rs. 1,188"
  },
  {
    "title": "OnePlus 5 Soft Silicon Cover With Internal Microfiber Case",
    "price": "Rs. 263"
  },
  {
    "title": "Redmi 9 Power Ipaky Case With Back Transparent Case",
    "price": "Rs. 242"
  },
  {
    "title": "Soft Silicon Case With Fur Inside For Iphone 13 Pro",
    "price": "Rs. 250"
  },
  {
    "title": "Shockproof Transparent Soft Case For iPhone x, xr, xs, max, 11, 12, 13, 14, 15 Apple",
    "price": "Rs. 149"
  },
  {
    "title": "Strong Magnetic Clear Case For IPhone 11 To 14 Pro Max",
    "price": "Rs. 499"
  },
  {
    "title": "UCUC for Redmi K40 / K40 Pro / Xiaomi Poco F3 / Mi 11x Back Cover Cartoon Robot Transparent TPU Ultra Thin Soft Phone Cases",
    "price": "Rs. 675"
  },
  {
    "title": "Nillkin Super Frosted Shield Samsung S21 Ultra",
    "price": "Rs. 1,198"
  },
  {
    "title": "Back Cover for Mi Redmi Note 8 Pro Back Cover Case - Black Silicon",
    "price": "Rs. 189"
  },
  {
    "title": "Realme Narzo 60 Ipaky Case With Back Transparent Case",
    "price": "Rs. 250"
  },
  {
    "title": "Samsung Galaxy M14(5G) Border Cover With Back Transparent",
    "price": "Rs. 450"
  },
  {
    "title": "Hontinga for Xiaomi Poco M5 Back Cover Fashion KAWS Side Design Soft Liquid Silicone Phone Case",
    "price": "Rs. 839"
  },
  {
    "title": "Masala Beads Luxury Transparent Mirror Glass Phone Cases For iPhone TPU Protective Cover Shock proof Clear Case Covers",
    "price": "Rs. 405"
  },
  {
    "title": "Infinix Hot 50 Pro Plus Ipaaky Transparent Back Case",
    "price": "Rs. 200"
  },
  {
    "title": "Shockproof Transparent Back Case for iPhone 13 / 13 Mini - Heavy Duty Protection - Mobihub",
    "price": "Rs. 146"
  },
  {
    "title": "Shockproof Motorola Edge 60 fUSION Transparent Case with Reinforced Corners | Anti- Yellowing | Anti-Drop Back Cover | Raised Camera Protection Bump",
    "price": "Rs. 600"
  },
  {
    "title": "Premium Silicone Case For iPhone X / XS By Lavish Deals",
    "price": "Rs. 396"
  },
  {
    "title": "Back Cover Case for Samsung Galaxy A56 5G | Shockproof Soft TPU Case | Cushioned Edges for Ultimate Protection Back Cover Case for Samsung A56 (TPU, Transparent)",
    "price": "Rs. 152"
  },
  {
    "title": "Case for OPPO a3x OPPO a3 5g oppo a5 pro 5g OPPO A5X 5G A5 4G phone casing back cover Softcase Silicone shockproof Cover new design aesthetic Rotatable mirror Cute Bear with holder JTXXZJ01",
    "price": "Rs. 131"
  },
  {
    "title": "Silicone case for Realme 11 Pro / Plus | Microfiber Inside | 360 Degree Camera Protection Bump Back Phone Cover",
    "price": "Rs. 304"
  },
  {
    "title": "lthmy for Huawei Y9S TPU Silicone Soft Case Casing Full Camera Protection Phone Cover",
    "price": "Rs. 1,499"
  },
  {
    "title": "Redmi note 14 pro (5G) -Back Cover | Liquid Silicon Magic Case with Camera Protection | Black",
    "price": "Rs. 550"
  },
  {
    "title": "For Redmi Note 12 4G Case - Air Cushion Hard Crystal Transparent Clear Back Phone Cover",
    "price": "Rs. 290"
  },
  {
    "title": "Jizetin for Redmi K40 / K40 Pro / Xiaomi Poco F3 / Mi 11x Back Cover Spider Man PU Leather For Girls Boys Soft Phone Case",
    "price": "Rs. 779"
  },
  {
    "title": "For Honor X9c 5G / Honor X9c Smart 5G Case with Braided Lanyard + Makeup Mirror Stand Luxury Shiny Plating Glitter Girls Phone Cases",
    "price": "Rs. 1,060"
  },
  {
    "title": "AnDyH For OPPO Reno 7 Pro 5G Phone Case Skin Feel Leather Soft Silicone All Inclusive Lens Cover Casing",
    "price": "Rs. 758"
  },
  {
    "title": "Infinix Hot 50 Pro Plus Phone Case for Infinix GT 20 Pro Hot 50i 3in1 Privacy Hydrogel Film + Camera Lens Film",
    "price": "Rs. 143"
  },
  {
    "title": "For Redmi Note 11 Pro 4G/5G Back Case - Shockproof Slim Hybrid Clear Transparent Phone Cover",
    "price": "Rs. 275"
  },
  {
    "title": "Nothing Phone 2A 5G / Nothing 2A Plus -Back Cover | Liquid Silicon Magic Case with Camera Protection | Black",
    "price": "Rs. 455"
  },
  {
    "title": "Samsung A23 4g/5g cover best",
    "price": "Rs. 299"
  },
  {
    "title": "For Samsung Galaxy S21 FE GKK Three Stage Splicing Full Coverage PC Case",
    "price": "Rs. 700"
  },
  {
    "title": "Hontinga for Samsung M14 5G Back Cover Fashion KAWS Side Design Soft Liquid Silicone Phone Case",
    "price": "Rs. 839"
  },
  {
    "title": "iPhone 11 Pro Shockproof Transparent Back Cover - Transparent Shockproof TPU Case - Mobihub",
    "price": "Rs. 175"
  },
  {
    "title": "Transparent Protective Back Case Cover for Realme C55 / Narzo N55",
    "price": "Rs. 211"
  },
  {
    "title": "Poco F3 Soft Transparent TPU With Side Bumped Cover",
    "price": "Rs. 194"
  },
  {
    "title": "Silicone Case for Samsung Galaxy A32 4G - Camera Protective Flexible Phone Back Cover",
    "price": "Rs. 275"
  },
  {
    "title": "Mobihub Shockproof Transparent Case for iPhone 15 / 15 Plus / 15 Pro / 15 Pro Max - Camera & Corner Protection",
    "price": "Rs. 157"
  },
  {
    "title": "Hontinga for Xiaomi Poco X5 Pro 5G Back Cover Fashion KAWS Side Design Soft Liquid Silicone Phone Case",
    "price": "Rs. 839"
  },
  {
    "title": "Shockproof Transparent Clear Case for iPhone 14 / 14 Plus / 14 Pro / 14 Pro Max - Mobihub",
    "price": "Rs. 154"
  },
  {
    "title": "OnePlus Nord CE 3 5G Clear Transparent Shockproof Soft Tpu Cover Case",
    "price": "Rs. 157"
  },
  {
    "title": "Infinix Note 8i Semi Hard Border Cover",
    "price": "Rs. 148"
  },
  {
    "title": "HOCE Matte PU Leather Magnetic Phone Cases For Samsung Galaxy S25 S24 S23 Ultra Plus S23 S22 S21 S20 FE Magsafe Case Wireless Charging TPU Protective Cover",
    "price": "Rs. 819"
  },
  {
    "title": "Clear case for Huawei Mate 20 Pro - Transparent Soft Shockproof Airbag Crystal Back Cover",
    "price": "Rs. 267"
  },
  {
    "title": "XUNDO Case for iPhone XS Max - Shockproof Transparent PC + TPU Bumper Back Cover",
    "price": "Rs. 870"
  },
  {
    "title": "Redmi Note 14 Pro 5G Back Cover | Transparent Crystal Clear Hard PC Back Case with TPU Bumper, Drop Protection Case for Redmi Note 14 Pro 5G",
    "price": "Rs. 175"
  },
  {
    "title": "UCUC for Redmi Note 10 / Note 10S / Poco M5S Back Cover Music Bear Soft PU Leather Phone Cases",
    "price": "Rs. 775"
  },
  {
    "title": "Nothing Phone 3A Pro (5G) Ring Stand Shockproof Armor Case",
    "price": "Rs. 379"
  },
  {
    "title": "Redmi Note 11 / Note 11s Back Defense Case Cover - Ring Holder & Kickstand in-Built",
    "price": "Rs. 751"
  },
  {
    "title": "For Oppo F19 Pro Back Case - Clear PC Back Hybrid Transparent Phone Cover",
    "price": "Rs. 352"
  },
  {
    "title": "One Plus 7T Semi Hard Border Cover",
    "price": "Rs. 249"
  },
  {
    "title": "Mi A1 Soft Silicon Cover With Internal Microfiber Case",
    "price": "Rs. 242"
  },
  {
    "title": "Adorable 3D Rainbow Bear Ear Floral Transparent Phone Strap Case for Iphone 14, 13, 12, 11 Pro Max, XR, XS Clear Soft",
    "price": "Rs. 750"
  },
  {
    "title": "Samsung Galaxy A53 5G Back Cover Soft TPU Case cover",
    "price": "Rs. 250"
  },
  {
    "title": "Hontinga for Samsung S21 Ultra 5G Back Cover With Kitty Mirror Folding Bracket Soft Silicone Phone Case",
    "price": "Rs. 1,007"
  },
  {
    "title": "Cat and Mouse Graffiti Phone Case Compatible for IPhone 7Plus 16 15 11 12 14 13 Pro Max 8 7 Plus XR X XS Max Couples Plating Metal Lens Soft Cover",
    "price": "Rs. 788"
  },
  {
    "title": "Silicone case for Techno Spark 6 Go | Microfiber Inside | 360 Degree Camera Protection Bump Back Phone Cover",
    "price": "Rs. 267"
  },
  {
    "title": "Shockproof Transparent Back Case For Realme 11 5g & 11X / Realme Narzo 60X",
    "price": "Rs. 325"
  },
  {
    "title": "Kickstand Back Cover Phone Case For infinix GT 20 Pro/X6871 Dirt-resistant Anti-dust ring Cute Wrist Strap Cartoon",
    "price": "Rs. 358"
  },
  {
    "title": "Hontinga for Redmi Note 9 Pro 9S Note 9 Pro Max Back Cover Spider-Man Pattern Ladder Soft Camera Protection Rubber Phone Case",
    "price": "Rs. 775"
  },
  {
    "title": "Redmi 10 Prime Transparent Soft Clear Back Case | Shockproof, Wireless Charging Compatible, Ultra-Clear Design, Easy Access Ports",
    "price": "Rs. 155"
  },
  {
    "title": "Oppo Reno 2f / Reno 2Z Back Cover Hybrid Shockproof Slim ipaky",
    "price": "Rs. 226"
  },
  {
    "title": "Soft Silicon Case with Inner Fur Lining for iPhone 11 Pro Max Protective Cover",
    "price": "Rs. 249"
  },
  {
    "title": "Only for iQOO Neo 10r 5G Phone Case - Bumper Back Hard Transparent Clear Shockproof TPU Phone Cover - Mero Deals",
    "price": "Rs. 415"
  },
  {
    "title": "Jizetin for iPhone 11 12 13 14 15 Pro Max 14 15 Plus 6S 7 8 Plus SE 2020 2022 XS Max XR Back Cover Crystal Transparent Messi Star Soft Full Camera Cover Protection Phone Cases",
    "price": "Rs. 679"
  },
  {
    "title": "Nothing Phone 3A NIUKIN Luxury Phone Case",
    "price": "Rs. 332"
  },
  {
    "title": "For OnePlus 8T / 9R (5G) Defender Case | Rotating Ring Holder & Kickstand in-Built",
    "price": "Rs. 542"
  },
  {
    "title": "Samsung A34 5G Clear Transparent Soft Flexible Cover Case",
    "price": "Rs. 189"
  },
  {
    "title": "Silicone case for Motorola Moto G34 / G45 5G | Microfiber Inside | 360 Degree Camera Protection Bump Back Phone Cover",
    "price": "Rs. 356"
  },
  {
    "title": "Motorola Edge 40 Neo Border Cover With Back Transparent",
    "price": "Rs. 267"
  },
  {
    "title": "Redmi Note 10 Pro Max Shockproof Clear Back Case TPU Acrylic Hybrid Cover",
    "price": "Rs. 275"
  },
  {
    "title": "MagSafe clear case For Iphone All Model ( 7plus , X , Xs , Xs max , 11 , 11 pro , 11 pro max , 12 , 12 mini ,12 pro ,12 pro max , 13 , 13 pro , 13 mini , 13 pro max , 15 series , 16. series",
    "price": "Rs. 499"
  },
  {
    "title": "Oppo F5 Soft Rubber Silicon Pattern Cover",
    "price": "Rs. 250"
  },
  {
    "title": "Silicone case for Vivo V40E 5G / iQOO Z9s 5G - Slim Silicone with Soft Lining Shockproof Full Body Bumper Case (Black)",
    "price": "Rs. 350"
  },
  {
    "title": "Redmi Note 13(4G) Border Cover With Back Transparent",
    "price": "Rs. 240"
  },
  {
    "title": "Samsung J7 Prime Camera Protection Matte Semi Hard Cover",
    "price": "Rs. 199"
  },
  {
    "title": "Shockproof Transparent Back Case For Samsung S10 Plus",
    "price": "Rs. 204"
  },
  {
    "title": "VIVO V50 (5G) Ring Stand Shockproof Armor Case",
    "price": "Rs. 428"
  },
  {
    "title": "Oneplus Nord CE 5G Armor Bumper Protection Case | Ring Holder Stand Case",
    "price": "Rs. 527"
  },
  {
    "title": "Hontinga for Vivo V29 5G Back Cover Fashion KAWS Side Design Soft Liquid Silicone Phone Case",
    "price": "Rs. 839"
  },
  {
    "title": "Ipaaky Transparent Back Case For Mi 11 Lite",
    "price": "Rs. 240"
  },
  {
    "title": "Funny Cute Animals Cats Dog Bear Graffiti Phone Case Compatible for IPhone 11 15 14 13 12 Pro Max XR X XS Cream Puffs Luxury Silicon Shockproof Cover",
    "price": "Rs. 696"
  },
  {
    "title": "HOCE Liquid Silicone Magnetic Phone Cases For iPhone 17 16 15 14 13 12 11 Pro Max 14 15 16 Plus MagSafe Case Candy Color Shockproof Bumper Cover",
    "price": "Rs. 1,179"
  },
  {
    "title": "Leather Texture Side Card Insert Phone Case For iPhone 16 15 14 13 12 11 Pro X XS XR Max 8 7 Plus SE Wallet Bumper Solid Cover",
    "price": "Rs. 402"
  },
  {
    "title": "Samsung Galaxy M31 Shockproof Transparent Back Case",
    "price": "Rs. 240"
  },
  {
    "title": "Motorola EDGE 50 Fusion Border Cover With Back Transparent",
    "price": "Rs. 339"
  },
  {
    "title": "Camera Protective Silicone Case For Samsung Galaxy A22 5G / F42",
    "price": "Rs. 368"
  },
  {
    "title": "Ipaaky Transparent Back Case For Vivo Y22s",
    "price": "Rs. 239"
  },
  {
    "title": "Poco F3 Soft Silicon Case With Fur Inside",
    "price": "Rs. 242"
  },
  {
    "title": "Biruiqu For Samsung Galaxy A55 5G Hybrid Soft TPU Deer pattern cloth pattern Shockproof Case Cover",
    "price": "Rs. 662"
  },
  {
    "title": "Premium Marble Case For iPhone 13 Pro Max Protective Stylish Cover",
    "price": "Rs. 675"
  },
  {
    "title": "HOCE Ultra Thin Frameless Phone Cases For Samsung Galaxy S25 S24 S23 S22 Ultra Plus Case With Lens Protection Luxury Plating Frame Clear Hard Back Cover",
    "price": "Rs. 859"
  },
  {
    "title": "Soft Silicon Case With Fur Inside For Huawei P30 Lite",
    "price": "Rs. 242"
  },
  {
    "title": "Vivo V17 Vivo V19 Ipaky Mobile Cover, Mobile Case, Back Cover Shockproof, Drop Protection, Non Yellowing, Anti Scratch",
    "price": "Rs. 197"
  },
  {
    "title": "Realme X3 / SuperZoom Coque Shockproof Case Phone Cover Protective Case Clear Shell For Realme X3 / SuperZoom Cover",
    "price": "Rs. 261"
  },
  {
    "title": "Nillkin Super Frosted Shield Pro Case for Nothing Phone 3A",
    "price": "Rs. 1,398"
  },
  {
    "title": "Clear Transparent Shockproof Soft Tpu Cover Case For Vivo V29e",
    "price": "Rs. 189"
  },
  {
    "title": "Mobile Cover Samsung Galaxy S23 Ultra Transparent Clear Case",
    "price": "Rs. 123"
  },
  {
    "title": "Premium Silicone Case For iPhone 15 Pro Max By Lavish Deals",
    "price": "Rs. 351"
  },
  {
    "title": "Case for Redmi 12 4G - Silicone Phone Cover with Camera Protection",
    "price": "Rs. 270"
  },
  {
    "title": "Hontinga for Vivo V27 5G V27 Pro 5G Back Back Cover Cute Lovely Girl Cream Texture Wavy Edge Soft Phone Case",
    "price": "Rs. 806"
  },
  {
    "title": "Phone Case For Xiaomi 11T / Pro - Protective Airbag Bumper Transparent Cover",
    "price": "Rs. 490"
  },
  {
    "title": "Redmi 13C Transparent TPU Silicon Cover",
    "price": "Rs. 149"
  },
  {
    "title": "Trend Brand Cool Boy Dark Doodle Pattern Compatible for IPhone 11 16 14 15 13 12 Pro Max 16 8 15 7 14 Plus 7Plus XR X XS Max SE 2020 Couples Luxury Plating Metal Lens Graffiti Letters Cover",
    "price": "Rs. 717"
  },
  {
    "title": "VIVO V50 (5G) -Back Cover | Liquid Silicon Magic Case with Camera Protection | Black",
    "price": "Rs. 455"
  },
  {
    "title": "Hoco Magnetic Series Airbag Anti-Fall Protective Shell For Iphone 13 Mini 5.4″ Transparent",
    "price": "Rs. 950"
  },
  {
    "title": "Oppo Realme P2 Pro Phone Case,Soft TPU ShockProof Phone Case Cover for Oppo Realme P2 Pro",
    "price": "Rs. 528"
  },
  {
    "title": "Hotinga for Samsung A16 5G Back Cover Full of Love Soft Texture Phone Case Wavy Edge Silicone Cover",
    "price": "Rs. 806"
  },
  {
    "title": "For Redmi 9c/10A, Poco C31 Back Case - Clear Transparent Case",
    "price": "Rs. 199"
  },
  {
    "title": "Jizetin for iPhone 11 12 13 Mini 14 15 16 Pro Max 6S 7 8 Plus SE 2020 2022 XS Max XR Back Cover Batman Lambskin Texture PU Leather Back For Girls Boys Soft Phone Case",
    "price": "Rs. 779"
  },
  {
    "title": "Iphone 13 Soft Silicon Cover With Internal Microfiber Case",
    "price": "Rs. 242"
  },
  {
    "title": "Hontinga for Redmi Note 12 4G Back Cover Fashion KAWS Side Design Soft Liquid Silicone Phone Case",
    "price": "Rs. 839"
  },
  {
    "title": "Soft Silicon Case With Fur Inside For OnePlus 6T",
    "price": "Rs. 242"
  },
  {
    "title": "Black Dots Case Compatible for IPhone 7Plus 11 15 14 13 12 Pro Max XR 7 15 14 8 Plus X XS Max SE Romance Pink Bow Flower Butterfly Shine Star Transparent Soft Cover",
    "price": "Rs. 739"
  },
  {
    "title": "Soft Silicon Case With Fur Inside For Samsung Galaxy S10 Plus",
    "price": "Rs. 242"
  },
  {
    "title": "Masala Beads Y2K Cool Snake Cross Love Heart Gradient Phone Case for Iphone Case Mobile Cover Cases",
    "price": "Rs. 405"
  },
  {
    "title": "Hontinga for OPPO Reno6 5G Back Cover Fashion KAWS Side Design Soft Liquid Silicone Phone Case",
    "price": "Rs. 839"
  },
  {
    "title": "Clear Airbag Case for iPhone X / XS- Shockproof TPU Transparent Soft Silicone Phone Back Cover",
    "price": "Rs. 150"
  },
  {
    "title": "Clear Case for Samsung Galaxy A55 5G - Camera Protection Soft Bumper Transparent Shockproof Slim Back Cover",
    "price": "Rs. 214"
  },
  {
    "title": "Transparent TPU Case for Redmi Note 11 Pro 4G/5G /Redmi Note 11/11S 4G Cover Clear Anti-Scratch Cover Case with Camera Protection",
    "price": "Rs. 148"
  },
  {
    "title": "Hontinga for Xiaomi 11 Lite 4G 5G 11 Lite 5G NE Back Cover Tulip Butterfly Phone Case Cream Texture Wavy Edge Soft Mobile Cover",
    "price": "Rs. 806"
  },
  {
    "title": "Samsung Galaxy A35 5G Clear Transparent TPU Silicon Cover",
    "price": "Rs. 181"
  },
  {
    "title": "Shockproof Transparent Back Case For Redmi 10 Prime",
    "price": "Rs. 204"
  },
  {
    "title": "OnePlus Nord 2 5G Clear Transparent Soft Flexible Cover Case",
    "price": "Rs. 160"
  },
  {
    "title": "HODON Gradient Color Hard Shell Phone Case for Samsung Galaxy Z Flip 6 5 4 3 Flip5 Flip4 Flip3 Flip6 5G Cases Full Package Hinge Protection Cover",
    "price": "Rs. 1,859"
  },
  {
    "title": "Honor X7C Soft Silicon Pattern Cover",
    "price": "Rs. 232"
  },
  {
    "title": "MyChoice Case for Samsung Galaxy S20 Ultra (S11+) Luxury Shockproof Soft Edge Silicone Frame PC Matt Back Cover",
    "price": "Rs. 145"
  },
  {
    "title": "6D Electroplating Chrome Cover for REDMI 9/9Prime/Poco M2",
    "price": "Rs. 164"
  },
  {
    "title": "Realme 10 Pro Plus 5G Case - Silicone Camera Protection Bump Back Cover",
    "price": "Rs. 299"
  },
  {
    "title": "Transparent Hard Flexible TPU Case For iphone 6S Plus",
    "price": "Rs. 116"
  },
  {
    "title": "Redmi 14C Transparent Clear Hybrid Shockproof Slim Phone Case",
    "price": "Rs. 194"
  },
  {
    "title": "S22 Ultra/S23 Ultra/S24Plus/S24 Ultra/Silky And Soft-Touch Finish Slicone Case Premium Quality",
    "price": "Rs. 350"
  },
  {
    "title": "Benco S1Pro Soft Cover With Camera Protection Cover Case DurgaMobileHouse",
    "price": "Rs. 265"
  },
  {
    "title": "6D Electroplating Chrome Cover for REDMI NOTE 12 5G / Poco X5",
    "price": "Rs. 174"
  },
  {
    "title": "Only for OPPO Reno 6 Z 6Z 5G Phone Case - Bumper Back Hard Transparent Clear Shockproof TPU Phone Cover - Mero Deals",
    "price": "Rs. 304"
  },
  {
    "title": "Jizetin for iPhone 11 12 13 14 15 Pro Max 14 15 Plus 6S 7 8 Plus SE 2020 2022 XS Max XR Back Cover Transparent Ronaldo Star Soft Phone Case",
    "price": "Rs. 679"
  },
  {
    "title": "For OnePlus Nord 2T 5G Case - Soft Silicone Gel TPU Back Cover",
    "price": "Rs. 309"
  },
  {
    "title": "Redmi 10 Prime Transparent TPU Silicon Cover",
    "price": "Rs. 169"
  },
  {
    "title": "Nillkin Super Frosted Case for Xiaomi Redmi Note 11S 5G, Redmi Note 11T 5G& Poco M4 Pro 5G Hard Matt Cover",
    "price": "Rs. 767"
  },
  {
    "title": "Samsung Galaxy A54 5G Soft Clear Back Case Shockproof Transparent Cover with Wireless Charging Support",
    "price": "Rs. 155"
  },
  {
    "title": "Lenuo For Xiaomi 11T / 11T PRO Mobile Phone Case Ring Bracket Back Cover Camera Protection",
    "price": "Rs. 1,412"
  },
  {
    "title": "Soft Silicon Case With Fur Inside For Iphone 11 Pro Max",
    "price": "Rs. 116"
  },
  {
    "title": "Transparent Hard Flexible TPU Case for iphone 7 Plus",
    "price": "Rs. 300"
  },
  {
    "title": "Luxury Lychee Leather Case Compatible for IPhone 11 Pro Max 16 13 14 15 12 Pro Max 12 Pro 16 Pro 15 Pro 15 16 14 Plus Cute Lying Down Kitten Creative Homemade Cat 3 Dolls",
    "price": "Rs. 750"
  },
  {
    "title": "OnePlus 7T Soft Silicone Back Case with Camera Protection Bumper, Non-Slip Grip, Wireless Charging Compatible",
    "price": "Rs. 298"
  },
  {
    "title": "Luxury Phone Case with Mirror Holder Design For Samsung Galaxy A56 A36 A26 A16 A55 A35 A25 A15 with Lens Film Protection Design A05S Comes with Glitter Paper Suitable for Girls A variety of colors are available",
    "price": "Rs. 699"
  },
  {
    "title": "Rock case for Vivo V27 / V27 Pro - Global Pure Color Liquid Silicone Shockproof Phone Cover Ultra Thin (Black)",
    "price": "Rs. 304"
  },
  {
    "title": "Crystal Clear Case for Apple iPhone 7 & iPhone 8 Transparent Hard Back Protection Cover",
    "price": "Rs. 147"
  },
  {
    "title": "Oppo F23 (5G) Oppo A1 (5G) 0ppo A98 (5G) Clear Transparent With Bumper Cover Case -Non Yellowing",
    "price": "Rs. 239"
  },
  {
    "title": "Samsung Galaxy M31, F41, M30s, M21 Transparent Hybrid Hard PC TPU Back Cover Case, Shockproof, Screen Protection",
    "price": "Rs. 255"
  },
  {
    "title": "Carbon Fiber Case for Samsung Galaxy J2 Core (SM- J260) Back Protective Soft Cover",
    "price": "Rs. 145"
  },
  {
    "title": "Premium Marble Case For iPhone 14 Pro Max Protective Stylish Cover",
    "price": "Rs. 675"
  },
  {
    "title": "Vivo V23E V23E 5G Back Cover - Slim and Soft Liquid Silicone Protective Case",
    "price": "Rs. 318"
  },
  {
    "title": "Clear case for Redmi Note 9 4G - Transparent Soft Shockproof Airbag Crystal Back Cover",
    "price": "Rs. 170"
  },
  {
    "title": "Cmf Phone 1 Soft Silicon Case With Fur Inside",
    "price": "Rs. 225"
  },
  {
    "title": "Hontinga for OnePlus 8T Back Cover NASA Astronaut Side Design Soft Liquid Silicone Phone Case",
    "price": "Rs. 839"
  },
  {
    "title": "Nothing CMF Phone 2 Pro Phone Case,Soft TPU Shockproof Cover Phone Case Cover for Nothing CMF Phone 2 Pro",
    "price": "Rs. 722"
  },
  {
    "title": "Xiaomi 15 Ultra Pundo Shockproof Sleek Hybrid Case Shell",
    "price": "Rs. 727"
  },
  {
    "title": "Back Cover Case for Redmi Note 14 4G | Raised Bumps for Camera & Screen Protection | Ultra Clear Soft Silicone Back Cover Case for Redmi Note 14 4G (TPU, Transparent)",
    "price": "Rs. 191"
  },
  {
    "title": "Realme 10 Pro Plus 5G Shockproof Transparent Back Case",
    "price": "Rs. 249"
  },
  {
    "title": "Clear case for OnePlus 5T - Transparent Soft Shockproof Airbag Crystal Back Cover",
    "price": "Rs. 220"
  },
  {
    "title": "Bumper Case for Samsung Galaxy S7 Edge - 360 Degree Protection | Protective Design | Transparent Back Cover",
    "price": "Rs. 375"
  },
  {
    "title": "0.3mm Ultra-Thin World's Thinnest Hard Protect Case Back Cover for iPhone 6 Plus, iPhone 6S Plus",
    "price": "Rs. 99"
  },
  {
    "title": "Shockproof Transparent Clear Phone Case For iPhone 13 Pro Max",
    "price": "Rs. 166"
  },
  {
    "title": "Clear Case Samsung Galaxy S23 FE (SM- S711BE) Four-Side Airbag Camera Protection Cover",
    "price": "Rs. 150"
  },
  {
    "title": "Vivo T2 Pro(5G) Ipaaky Case With Back Transparent Case",
    "price": "Rs. 227"
  },
  {
    "title": "For OnePlus Nord 2 (5G) Defender Case | Rotating Ring Holder & Kickstand in-Built - Camera Protection",
    "price": "Rs. 542"
  },
  {
    "title": "Clear case for Samsung Note 10 Lite - Transparent Soft Shockproof Airbag Crystal Phone Back Cover",
    "price": "Rs. 220"
  },
  {
    "title": "Transparent Clear Cover Case for Samsung Galaxy A04s",
    "price": "Rs. 147"
  },
  {
    "title": "【Inventory ready 】🚚 Free shipping+COD 🚚KT Cat phone case is suitable for iPhone 16, 16Pro, 16Plus, 16Pro Max, 15, 14, 13, 12, 11 Pro/ProMax/Plus XSMax, X XS XR, Sanrio Anime Cute Silicone Women's Phone Case",
    "price": "Rs. 359"
  },
  {
    "title": "Google Pixel 6A Soft Silicon Case With Fur Inside",
    "price": "Rs. 350"
  },
  {
    "title": "Back Cover Case for Infinix Note 40 (Shockproof Polycarbonate Dual Layer Hybrid Armor)",
    "price": "Rs. 444"
  },
  {
    "title": "Clear Case for Vivo V30 5G Transparent Soft Shockproof Cover",
    "price": "Rs. 199"
  },
  {
    "title": "Hontinga for Redmi 14C Back Cover Spider-Man Pattern Ladder Soft Camera Protection Rubber Phone Case",
    "price": "Rs. 775"
  },
  {
    "title": "Jizetin for Redmi Note 11 / Note 11S Back Cover Cloud Astronaut PU Leather For Girls Boys Soft Phone Case",
    "price": "Rs. 779"
  },
  {
    "title": "Hontinga for Xiaomi Poco X3 NFC X3 Pro Back Cover One Piece Luffy Pattern Ladder Soft Camera Protection Rubber Phone Case",
    "price": "Rs. 775"
  },
  {
    "title": "Nothing Phone 2A (5G) Case, Stylish Slim Liquid Silicone Full-Body Protective Cover",
    "price": "Rs. 189"
  },
  {
    "title": "Viral Ceramic Soft Transparent Camera Protection Case for iPhone 8 Plus - Scratch-Resistant, Durable",
    "price": "Rs. 249"
  },
  {
    "title": "Silicone Case for Samsung Galaxy A24 - Camera Protective Flexible Phone Back Cover",
    "price": "Rs. 275"
  },
  {
    "title": "For Poco X3/Pro 5G Back Case - Clear PC Back Hybrid Transparent Phone Cover",
    "price": "Rs. 270"
  },
  {
    "title": "Redmi Note 14 (4G) Slide Camera Cover Luxury Phone Case",
    "price": "Rs. 699"
  },
  {
    "title": "Samsung Galaxy S10 Plus Silicon Cover With Internal Microfiber Case",
    "price": "Rs. 250"
  },
  {
    "title": "Clear Case for Samsung Galaxy A16 5G Four-Side Airbag Camera Protection Cover",
    "price": "Rs. 147"
  }
]